In [1]:
import pandas as pd
#import matplotlib.pyplot as plt
import numpy as np

ModuleNotFoundError: No module named 'pandas'

Exercise 1:

In [15]:
data = pd.DataFrame([[1,100,10, "OOC"],
                     [2,200,30, "LLT"],
                     [3,123,11, "OOC"],
                     [4,400,99,"SJO"]],
                   columns=["orderID", "componentA", "componentB","customer"])

In [16]:
data

   orderID  componentA  componentB customer
0        1         100          10      OOC
1        2         200          30      LLT
2        3         123          11      OOC
3        4         400          99      SJO

In [34]:
data.describe()

        orderID  componentA  componentB        costA        costB      sumCost
count  4.000000    4.000000    4.000000     4.000000     4.000000     4.000000
mean   2.500000  205.750000   37.500000  2057.500000   562.500000  2620.000000
std    1.290994  136.377845   42.019837  1363.778452   630.297549  1991.536258
min    1.000000  100.000000   10.000000  1000.000000   150.000000  1150.000000
25%    1.750000  117.250000   10.750000  1172.500000   161.250000  1333.750000
50%    2.500000  161.500000   20.500000  1615.000000   307.500000  1922.500000
75%    3.250000  250.000000   47.250000  2500.000000   708.750000  3208.750000
max    4.000000  400.000000   99.000000  4000.000000  1485.000000  5485.000000

In [20]:
cA = data.loc[0]["componentA"]*10
cB = data.loc[0]["componentB"]*15
print(cA,cB)

1000 150

In [23]:
data["costA"] = data["componentA"]*10

In [25]:
data["costB"] = data["componentB"]*15

In [27]:
data["sumCost"] = data["costA"]+data["costB"]

In [28]:
data

   orderID  componentA  componentB customer  costA  costB  sumCost
0        1         100          10      OOC   1000    150     1150
1        2         200          30      LLT   2000    450     2450
2        3         123          11      OOC   1230    165     1395
3        4         400          99      SJO   4000   1485     5485

In [33]:
data.loc[data["customer"] == "OOC", "sumCost"].sum()

2545

In [30]:
data["costA"].mean()

2057.5

Data Import: